/*
 *                        _oo0oo_
 *                       o8888888o
 *                       88" . "88
 *                       (| -_- |)
 *                       0\  =  /0
 *                     ___/`---'\___
 *                   .' \\|     |// '.
 *                  / \\|||  :  |||// \
 *                 / _||||| -:- |||||- \
 *                |   | \\\  - /// |   |
 *                | \_|  ''\---/''  |_/ |
 *                \  .-\__  '-'  ___/-. /
 *              ___'. .'  /--.--\  `. .'___
 *           ."" '<  `.___\_<|>_/___.' >' "".
 *          | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *          \  \ `_.   \_ __\ /__ _/   .-` /  /
 *      =====`-.____`.___ \_____/___.-`___.-'=====
 *                        `=---='
 *
 *
 *      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 *            佛祖保佑     永不宕机     永无BUG
 *
 *        佛曰:
 *                写字楼里写字间，写字间里程序员；
 *                程序人员写程序，又拿程序换酒钱。
 *                酒醒只在网上坐，酒醉还来网下眠；
 *                酒醉酒醒日复日，网上网下年复年。
 *                但愿老死电脑间，不愿鞠躬老板前；
 *                奔驰宝马贵者趣，公交自行程序员。
 *                别人笑我忒疯癫，我笑自己命太贱；
 *                不见满街漂亮妹，哪个归得程序员？
 */

/*
 *                   江城子 . 程序员之歌
 *
 *               十年生死两茫茫，写程序，到天亮。
 *                   千行代码，Bug何处藏。
 *               纵使上线又怎样，朝令改，夕断肠。
 *
 *               领导每天新想法，天天改，日日忙。
 *                   相顾无言，惟有泪千行。
 *               每晚灯火阑珊处，夜难寐，加班狂。
 *
 */

/*
 * @Author: liqing 1913282756@qq.com
 * @Date: 2023-08-21 16:32:44
 * @LastEditors: liqing 1913282756@qq.com
 * @LastEditTime: 2023-08-23 14:16:46
 * @FilePath: \sourcetreeLocalrepo\LinuxDriver\temp.c
 * @Description:
 *
 * Copyright (c) 2023 by liqing, All Rights Reserved.
 */
#include <stdio.h>
#include "sort.h"

int main()
{
    int a[] = {2, 3, 1, 4, 6, 12, 13, 9, 21};
   // BubbleSort(a, 9 , 1);
    QuickSort(a, 0, 8,-1);
    // InsertSort(a, 9);
    // ShellSort(a, 9, 8,-1);

    // int* temp = malloc(sizeof(a) / sizeof(a[0]) + 1);
    // MergeSort(a,temp, 0, 8, -1);
    // free(temp);

    // SelectionSort(a, 9,-1);
    for (int i = 0; i < 9; i++)
    {
        printf("%d ", a[i]);
    }
    printf("\r\n");

    return 0;
}
